DocumentJournals/АР_ДокументыПоДоговорамАренды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DocumentJournal>
		<Properties>
			<Name>АР_ДокументыПоДоговорамАренды</Name>
			<RegisteredDocuments>
				<xr:Item>Document.АР17_ЗаключениеДоговораАренды</xr:Item>
				<xr:Item>Document.АР17_ДополнительноеСоглашение</xr:Item>
				<xr:Item>Document.АР_АктПриемаПередачиПомещенияВАренду</xr:Item>
				<xr:Item>Document.АР_АктПриемаВозвратаАрендуемогоПомещения</xr:Item>
				<xr:Item>Document.АР17_РасторжениеДоговораАренды</xr:Item>
				<xr:Item>Document.АР17_ИнформационныйДокумент</xr:Item>
			</RegisteredDocuments>
		</Properties>
		<ChildObjects>
			<Column>
				<Properties>
					<Name>Организация</Name>
					<References>
						<xr:Item>Document.АР17_ЗаключениеДоговораАренды.Attribute.Организация</xr:Item>
						<xr:Item>Document.АР17_ДополнительноеСоглашение.Attribute.Организация</xr:Item>
						<xr:Item>Document.АР_АктПриемаВозвратаАрендуемогоПомещения.Attribute.Организация</xr:Item>
						<xr:Item>Document.АР_АктПриемаПередачиПомещенияВАренду.Attribute.Организация</xr:Item>
						<xr:Item>Document.АР17_ИнформационныйДокумент.Attribute.Организация</xr:Item>
						<xr:Item>Document.АР17_РасторжениеДоговораАренды.Attribute.Организация</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Контрагент</Name>
					<References>
						<xr:Item>Document.АР17_ЗаключениеДоговораАренды.Attribute.Контрагент</xr:Item>
						<xr:Item>Document.АР17_ДополнительноеСоглашение.Attribute.Контрагент</xr:Item>
						<xr:Item>Document.АР_АктПриемаВозвратаАрендуемогоПомещения.Attribute.Контрагент</xr:Item>
						<xr:Item>Document.АР_АктПриемаПередачиПомещенияВАренду.Attribute.Контрагент</xr:Item>
						<xr:Item>Document.АР17_ИнформационныйДокумент.Attribute.Контрагент</xr:Item>
						<xr:Item>Document.АР17_РасторжениеДоговораАренды.Attribute.Контрагент</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<References>
						<xr:Item>Document.АР17_ЗаключениеДоговораАренды.Attribute.ДоговорКонтрагента</xr:Item>
						<xr:Item>Document.АР17_ДополнительноеСоглашение.Attribute.ДоговорКонтрагента</xr:Item>
						<xr:Item>Document.АР_АктПриемаВозвратаАрендуемогоПомещения.Attribute.ДоговорКонтрагента</xr:Item>
						<xr:Item>Document.АР_АктПриемаПередачиПомещенияВАренду.Attribute.ДоговорКонтрагента</xr:Item>
						<xr:Item>Document.АР17_ИнформационныйДокумент.Attribute.ДоговорКонтрагента</xr:Item>
						<xr:Item>Document.АР17_РасторжениеДоговораАренды.Attribute.ДоговорКонтрагента</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Комментарий</Name>
					<References>
						<xr:Item>Document.АР17_ЗаключениеДоговораАренды.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.АР17_ДополнительноеСоглашение.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.АР_АктПриемаВозвратаАрендуемогоПомещения.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.АР_АктПриемаПередачиПомещенияВАренду.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.АР17_РасторжениеДоговораАренды.Attribute.Комментарий</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<References>
						<xr:Item>Document.АР_АктПриемаВозвратаАрендуемогоПомещения.Attribute.РучнаяКорректировка</xr:Item>
						<xr:Item>Document.АР_АктПриемаПередачиПомещенияВАренду.Attribute.РучнаяКорректировка</xr:Item>
						<xr:Item>Document.АР17_ДополнительноеСоглашение.Attribute.РучнаяКорректировка</xr:Item>
						<xr:Item>Document.АР17_ЗаключениеДоговораАренды.Attribute.РучнаяКорректировка</xr:Item>
						<xr:Item>Document.АР17_РасторжениеДоговораАренды.Attribute.РучнаяКорректировка</xr:Item>
						<xr:Item>Document.АР17_ИнформационныйДокумент.Attribute.РучнаяКорректировка</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Ответственный</Name>
					<References>
						<xr:Item>Document.АР_АктПриемаВозвратаАрендуемогоПомещения.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.АР_АктПриемаПередачиПомещенияВАренду.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.АР17_ИнформационныйДокумент.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.АР17_ДополнительноеСоглашение.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.АР17_ЗаключениеДоговораАренды.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.АР17_РасторжениеДоговораАренды.Attribute.Ответственный</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>СтатусДоговора</Name>
					<References>
						<xr:Item>Document.АР17_ЗаключениеДоговораАренды.Attribute.СтатусДоговора</xr:Item>
						<xr:Item>Document.АР17_ДополнительноеСоглашение.Attribute.Статус</xr:Item>
						<xr:Item>Document.АР_АктПриемаВозвратаАрендуемогоПомещения.Attribute.Статус</xr:Item>
						<xr:Item>Document.АР_АктПриемаПередачиПомещенияВАренду.Attribute.Статус</xr:Item>
						<xr:Item>Document.АР17_РасторжениеДоговораАренды.Attribute.Статус</xr:Item>
						<xr:Item>Document.АР17_ИнформационныйДокумент.Attribute.Статус</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>АР_Москва</Name>
					<References>
						<xr:Item>Document.АР_АктПриемаВозвратаАрендуемогоПомещения.Attribute.АР_Москва</xr:Item>
						<xr:Item>Document.АР_АктПриемаПередачиПомещенияВАренду.Attribute.АР_Москва</xr:Item>
						<xr:Item>Document.АР17_ДополнительноеСоглашение.Attribute.АР_Москва</xr:Item>
						<xr:Item>Document.АР17_ЗаключениеДоговораАренды.Attribute.АР_Москва</xr:Item>
						<xr:Item>Document.АР17_РасторжениеДоговораАренды.Attribute.АР_Москва</xr:Item>
						<xr:Item>Document.АР17_ИнформационныйДокумент.Attribute.АР_Москва</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>АР_СанктПетербург</Name>
					<References>
						<xr:Item>Document.АР_АктПриемаВозвратаАрендуемогоПомещения.Attribute.АР_СанктПетербург</xr:Item>
						<xr:Item>Document.АР_АктПриемаПередачиПомещенияВАренду.Attribute.АР_СанктПетербург</xr:Item>
						<xr:Item>Document.АР17_ДополнительноеСоглашение.Attribute.АР_СанктПетербург</xr:Item>
						<xr:Item>Document.АР17_ЗаключениеДоговораАренды.Attribute.АР_СанктПетербург</xr:Item>
						<xr:Item>Document.АР17_РасторжениеДоговораАренды.Attribute.АР_СанктПетербург</xr:Item>
						<xr:Item>Document.АР17_ИнформационныйДокумент.Attribute.АР_СанктПетербург</xr:Item>
					</References>
				</Properties>
			</Column>
		</ChildObjects>
	</DocumentJournal>
</MetaDataObject>

InformationRegisters/АР_ШтрихКоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>АР_ШтрихКоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ШтрихКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АР17_ЗаключениеАгентскогоДоговора</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Подразделение</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФизическоеЛицо</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подготовлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяСервиса</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСвойстваПользователяИБ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фотография</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DocumentJournals/АР_ДокументыПоДоговорамАренды/Forms/ФормаСписка/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ
//

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)

	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Организация", ОтборОрганизация, ЗначениеЗаполнено(ОтборОрганизация));

КонецПроцедуры

&НаКлиенте
Процедура ОтборКонтрагентПриИзменении(Элемент)

	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Контрагент", ОтборКонтрагент, ЗначениеЗаполнено(ОтборКонтрагент));

КонецПроцедуры



////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ
//

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ОтборОрганизация = ОбщегоНазначенияБПВызовСервера.УстановитьОтборПоОсновнойОрганизации(ЭтаФорма);
	
	//+са
	ТекушийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	ПользовательСсылка = Справочники.Пользователи.НайтиПоНаименованию(СокрЛП(ТекушийПользователь.ПолноеИмя));
	//Если Не ПользовательСсылка.АР_Администратор Тогда
	//	Если ПользовательСсылка.АР_Москва Тогда
	//		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("АР_Москва");
	//		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//		ЭлементОтбора.Использование = Истина;
	//		ЭлементОтбора.ПравоеЗначение = Истина;
	//	Иначе
	//		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("АР_СанктПетербург");
	//		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//		ЭлементОтбора.Использование = Истина;
	//		ЭлементОтбора.ПравоеЗначение = Истина;
	//	КонецЕсли;
	//	
	//КонецЕсли;
	//-са
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ИзменениеОсновнойОрганизации" Тогда
		ОтборОрганизация = ОбщегоНазначенияБПКлиент.ИзменитьОтборПоОсновнойОрганизации(Список, ,Параметр);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ШКПриИзменении(Элемент)
	
	Список.Отбор.Элементы.Очистить();
	эо = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	эо.Использование  = Истина;
	эо.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ШКСтрока");
	эо.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	эо.ПравоеЗначение = ШК;
	
	Если НЕ ЗначениеЗаполнено(ШК) Тогда
		Список.Отбор.Элементы.Очистить();
	КонецЕсли;	
	
	ШКПриИзмененииНаСервере();

	ПодключитьОбработчикОжидания("Ожидание",0.1,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Ожидание()
	ТекущийЭлемент = Элементы.ШК;
КонецПроцедуры

&НаСервере
Процедура ШКПриИзмененииНаСервере()
	// Вставить содержимое обработчика.
// + Рогачев  Андрей от 17.08.2016  № 108890
		Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ШтрихКоды.ШтрихКод,
	|	ШтрихКоды.СсылкаНаОбъект
	|ИЗ
	|	РегистрСведений.АР_ШтрихКоды КАК ШтрихКоды
	|ГДЕ
	|	ШтрихКоды.ШтрихКод = &ШтрихКод";
	//Запрос.УстановитьПараметр("СсылкаНаОбъект",Ссылка);
	Запрос.УстановитьПараметр("ШтрихКод",ШК);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		// Штрих код есть !!!
		//------------------
		Если  ЗначениеЗаполнено(Выборка.СсылкаНаОбъект.Передан) И Не  ЗначениеЗаполнено(Выборка.СсылкаНаОбъект.Возвращен) Тогда 
			ДокОб=Выборка.СсылкаНаОбъект.ПолучитьОбъект();
			Движение = ДокОб.Движения.АР_ПереданныеДокументы.ДобавитьРасход();
			
			ОбъектАренды = Справочники.АР_ОбъектыАренды.ПустаяСсылка();
			
			Попытка 
				ОбъектАренды = Выборка.СсылкаНаОбъект.Состав[0].ОбъектАренды;
			Исключение
				Если Выборка.СсылкаНаОбъект.ПостояннаяЧастьАренднойПлаты.Количество() Тогда 
					ОбъектАренды = Выборка.СсылкаНаОбъект.ПостояннаяЧастьАренднойПлаты[0].ОбъектАренды;
				ИначеЕсли Выборка.СсылкаНаОбъект.ПеременнаяЧастьАренднойПлаты.Количество() Тогда 
					ОбъектАренды = Выборка.СсылкаНаОбъект.ПеременнаяЧастьАренднойПлаты[0].ОбъектАренды;
				КонецЕсли;
			КонецПопытки;
			
			Движение.Период       = ТекущаяДата();
			Движение.Организация  = Выборка.СсылкаНаОбъект.Организация;
			Движение.Документ     = Выборка.СсылкаНаОбъект.Ссылка;
			Движение.ОбъектАренды = ОбъектАренды;
			Движение.ПереданоЭкземпляров = 1;
			Движение.Контрагент   = Выборка.СсылкаНаОбъект.Контрагент;
			Движение.ДоговорКонтрагента = Выборка.СсылкаНаОбъект.ДоговорКонтрагента;
			Движение.Регистратор  = Выборка.СсылкаНаОбъект;
			
				ДокОб.Движения.АР_ПереданныеДокументы.УстановитьАктивность(Истина);
		
			ДокОб.Движения.АР_ПереданныеДокументы.Записывать = Истина;	
			//ДокОб.Возвращен=Истина;
			ДокОб.Возвращен=ТекущаяДата();
			Попытка
				ДокОб.Записать();
			Исключение
			конецпопытки;
		КонецЕсли;
		
	конецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ШКОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)

	//СтандартнаяОбработка = Ложь;
	//ШК = Текст;
	//ТекущийЭлемент = Элементы.ШК;
КонецПроцедуры

&НаКлиенте
Процедура ОтборСтатусПриИзменении(Элемент)
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "СтатусДоговора", ОтборСтатус, ЗначениеЗаполнено(ОтборСтатус));
КонецПроцедуры

&НаКлиенте
Процедура ОтборТипДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОтборТипДокумента1 = ВыбратьТип(Элемент, СтандартнаяОбработка);
	Если ОтборТипДокумента1 = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ОтборТипДокумента = ОтборТипДокумента1;
	
	//Список1 = Новый СписокЗначений;
	//Для Каждого Стр Из Список.Отбор.ДоступныеПоляОтбора.Элементы[14].ДоступныеЗначения Цикл
	//	Список1.Добавить(Стр.Значение);
	//КонецЦикла;
	//ОтборТипДокумента=ВыбратьИзСписка(Список1, Элементы.ОтборТипДокумента, Список1[1]);
КонецПроцедуры

&НаКлиенте
Функция ВыбратьТип(Элемент, СтандартнаяОбработка)
	
	Список1 = Новый СписокЗначений;
	//Для Каждого Стр Из Список.Отбор.ДоступныеПоляОтбора.Элементы[14].ДоступныеЗначения Цикл
	Для к=1 По 6 Цикл
		Список1.Добавить(Список.Отбор.ДоступныеПоляОтбора.Элементы[14].ДоступныеЗначения[к].Значение);
	КонецЦикла;
	ВыбранныйТип=ВыбратьИзСписка(Список1, Элементы.ОтборТипДокумента);
	
	Если ВыбранныйТип = Неопределено тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Индекс = Список1.Индекс(ВыбранныйТип);
	//Если Индекс = 0 ИЛИ Индекс = Список1.Количество() - 1 тогда
	//	ВыбранныйТип = ВыбратьТип(Элемент, СтандартнаяОбработка);
	//КонецЕсли;
	
	Возврат ВыбранныйТип;
КонецФункции	


&НаСервере
Процедура ОтборТипДокументаПриИзмененииНаСервере()
	//эо = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//эо.Использование  = Истина;
	//эо.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Тип");
	//эо.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	//эо.ПравоеЗначение = ОтборТипДокумента;
КонецПроцедуры

&НаКлиенте
Процедура ОтборТипДокументаПриИзменении(Элемент)
	ОтборТипДокументаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтборТипДокументаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	а=а;
КонецПроцедуры

&НаКлиенте
Процедура ОтборТипДокументаНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	а=а;
КонецПроцедуры

&НаКлиенте
Процедура ОтборТипДокументаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	а=а;
КонецПроцедуры

&НаКлиенте
Процедура ОтборТипДокументаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОтборТипДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка);

	ОтборТипДокументаАвтоПодборНаСервере();
	
КонецПроцедуры


&НаКлиенте
Процедура ОтборТипДокументаАвтоПодборНаСервере()
	Список.Отбор.Элементы.Очистить();
	эо = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	эо.Использование  = Истина;
	эо.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Тип");
	эо.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	эо.ПравоеЗначение = ОпределитьТип(ОтборТипДокумента);
	
КонецПроцедуры

Функция ОпределитьТип(ОтборТипДокумента)
	Если ОтборТипДокумента = "Акт приема-возврата арендуемого помещения" Тогда
		Возврат Тип("ДокументСсылка.АР_АктПриемаВозвратаАрендуемогоПомещения");
	ИначеЕсли ОтборТипДокумента = "Акт приема-передачи помещения в аренду" Тогда
		Возврат Тип("ДокументСсылка.АР_АктПриемаПередачиПомещенияВАренду");	
	ИначеЕсли ОтборТипДокумента = "Дополнительное соглашение (2017)" Тогда
		Возврат Тип("ДокументСсылка.АР17_ДополнительноеСоглашение");	
	ИначеЕсли ОтборТипДокумента = "Заключения договоров аренды и услуг (2017)" Тогда
		Возврат Тип("ДокументСсылка.АР17_ЗаключениеДоговораАренды");	
	ИначеЕсли ОтборТипДокумента = "Информационный документ" Тогда
		Возврат Тип("ДокументСсылка.АР17_ИнформационныйДокумент");	
	ИначеЕсли ОтборТипДокумента = "Расторжение договора аренды (2017)" Тогда
		Возврат Тип("ДокументСсылка.АР17_РасторжениеДоговораАренды");	
	КонецЕсли;	
КонецФункции


&НаКлиенте
Процедура ОтборТипДокументаОчистка(Элемент, СтандартнаяОбработка)
	Список.Отбор.Элементы.Очистить();
	//эо = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//эо.Использование  = Истина;
	//эо.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Тип");
	//эо.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	//эо.ПравоеЗначение = Неопределено;
	//ПользовательскийОтбор = Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Список.КомпоновщикНастроек.Настройки.Отбор.ИдентификаторПользовательскойНастройки);
	//ПользовательскийОтбор.Элементы.Очистить();
	//Список.КомпоновщикНастроек.Настройки.Отбор.Элементы
КонецПроцедуры
